export const cardList = [
    {
        id: "f001",
        name: "フリーザー",
        hp: 140,
        type: "💧", 
        hasAbility: true,
        abName: "ひょうけつのまい",
        abText: "自分の番に1回使える。水エネを1枚自分につける。",
        abLoc: "battle",
        attacks: [
            { cost: "💧💧", name: "ふぶき", dmg: "80", text: "相手のベンチ全員にも10ダメージ。" }
        ],
        weakness: "⚡",
        retreat: "⚪⚪"
    },
    {
        id: "p001",
        name: "ピカチュウ",
        hp: 60,
        type: "⚡",
        hasAbility: false,
        attacks: [
            { cost: "", name: "じゅうでん", dmg: "0", text: "自分の山札から雷エネルギーを1枚自分につける。" },
            { cost: "⚡", name: "でんきショック", dmg: "20", text: "なし" }
        ],
        weakness: "✊",
        retreat: "⚪"
    },
    {
        id: "m002",
        name: "ミュウツーex",
        hp: 190,
        type: "👁️",
        hasAbility: false,
        attacks: [
            { cost: "👁️⚪", name: "ねんりき", dmg: "50", text: "なし" },
            { cost: "👁️👁️⚪", name: "サイコドライブ", dmg: "150", text: "超エネルギーを2個トラッシュする。" }
        ],
        weakness: "🌙",
        retreat: "⚪⚪"
    },
    {
        id: "d001",
        name: "ディグダ",
        hp: 50,
        type: "✊",
        hasAbility: false,
        attacks: [
            { cost: "", name: "ほりおこす", dmg: "0", text: "自分のトラッシュからアイテムを1枚回収する。" }
        ],
        weakness: "🌿",
        retreat: "" // にげる0
    }
];
